{"Pages":{"10":"","On top of the scaffolding, basic HTML elements are styled and enhanced with extensible classes to provide a fresh, consistent look and feel.":"","Icons by Glyphicons":"","Typography <small>Headings, paragraphs, lists, and other inline type elements</small>":"","Headings &amp; body copy":"","Typographic scale":"","The entire typographic grid is based on two Less variables in our variables.less file: <code>@baseFontSize</code> and <code>@baseLineHeight</code>. The first is the base font-size used throughout and the second is the base line-height.":"","We use those variables, and some math, to create the margins, paddings, and line-heights of all our type and more.":"","Example body text":"","Heading 1":"","Heading 2":"","Heading 3":"","Heading 4":"","Heading 5":"","Heading 6":"","Emphasis, address, and abbreviation":"","Element":"","Optional":"","For emphasizing a snippet of text with <strong>important</strong>":"","None":"","For emphasizing a snippet of text with <em>stress</em>":"","Wraps abbreviations and acronyms to show the expanded version on hover":"","Include optional <code>title</code> attribute for expanded text":"","Use <code>.initialism</code> class for uppercase abbreviations.":"","For contact information for its nearest ancestor or the entire body of work":"","Preserve formatting by ending all lines with <code>&lt;br&gt;</code>":"","Using emphasis":"","<strong>Note:</strong> Feel free to use <code>&lt;b&gt;</code> and <code>&lt;i&gt;</code> in HTML5, but their usage has changed a bit. <code>&lt;b&gt;</code> is meant to highlight words or phrases without conveying additional importance while <code>&lt;i&gt;</code> is mostly for voice, technical terms, etc.":"","Example addresses":"","Here are two examples of how the <code>&lt;address&gt;</code> tag can be used:":"","Full Name":"","first.last@gmail.com":"","Example abbreviations":"","Abbreviations with a <code>title</code> attribute have a light dotted bottom border and a help cursor on hover. This gives users extra indication something will be shown on hover.":"","Add the <code>initialism</code> class to an abbreviation to increase typographic harmony by giving it a slightly smaller text size.":"","<abbr title=\"HyperText Markup Language\" class=\"initialism\">HTML</abbr> is the best thing since sliced bread.":"","An abbreviation of the word attribute is <abbr title=\"attribute\">attr</abbr>.":"","Blockquotes":"","Block-level element for quoting content from another source":"","Add <code>cite</code> attribute for source URL":"","Use <code>.pull-left</code> and <code>.pull-right</code> classes for floated options":"","Optional element for adding a user-facing citation, typically an author with title of work":"","Place the <code>&lt;cite&gt;</code> around the title or name of source":"","To include a blockquote, wrap <code>&lt;blockquote&gt;</code> around any <abbr title=\"HyperText Markup Language\">HTML</abbr> as the quote. For straight quotes we recommend a <code>&lt;p&gt;</code>.":"","Include an optional <code>&lt;small&gt;</code> element to cite your source and you'll get an em dash <code>&amp;mdash;</code> before it for styling purposes.":"","Someone famous":"","Example blockquotes":"","Default blockquotes are styled as such:":"","Someone famous in <cite title=\"\">Body of work</cite>":"","To float your blockquote to the right, add <code>class=\"pull-right\"</code>:":"","Lists":"","Unordered":"","Unstyled":"","Ordered":"","Description lists":"","A description list is perfect for defining terms.":"","Horizontal description":"","Inline and block code snippets":"","For example, &lt;code&gt;section&lt;/code&gt; should be wrapped as inline.":"","Use <code>&lt;pre&gt;</code> for multiple lines of code. Be sure to escape any angle brackets in the code for proper rendering.":"","Sample text here...":"","<strong>Note:</strong> Be sure to keep code within <code>&lt;pre&gt;</code> tags as close to the left as possible; it will render all tabs.":"","You may optionally add the <code>.pre-scrollable</code> class which will set a max-height of 350px and provide a y-axis scrollbar.":"","<a href=\"http://code.google.com/p/google-code-prettify/\">Download google-code-prettify</a> and view the readme for <a href=\"http://google-code-prettify.googlecode.com/svn/trunk/README.html\">how to use</a>.":"","Tables <small>For, you guessed it, tabular data</small>":"","Table markup":"","Tag":"","Wrapping element for displaying data in a tabular format":"","Container element for table header rows (<code>&lt;tr&gt;</code>) to label table columns":"","Container element for table rows (<code>&lt;tr&gt;</code>) in the body of the table":"","Container element for a set of table cells (<code>&lt;td&gt;</code> or <code>&lt;th&gt;</code>) that appears on a single row":"","Default table cell":"","Special table cell for column (or row, depending on scope and placement) labels":"","Must be used within a <code>&lt;thead&gt;</code>":"","Description or summary of what the table holds, especially useful for screen readers":"","Table options":"","No styles, just columns and rows":"","Only horizontal lines between rows":"","Bordered":"","Rounds corners and adds outer border":"","Zebra-stripe":"","Adds light gray background color to odd rows (1, 3, 5, etc)":"","Condensed":"","Cuts vertical padding in half, from 8px to 4px, within all <code>td</code> and <code>th</code> elements":"","Example tables":"","Default table styles":"","Tables are automatically styled with only a few borders to ensure readability and maintain structure. With 2.0, the <code>.table</code> class is required.":"","First Name":"","Last Name":"","Username":"","Striped table":"","Get a little fancy with your tables by adding zebra-striping&mdash;just add the <code>.table-striped</code> class.":"","<strong>Note:</strong> Striped tables use the <code>:nth-child</code> CSS selector and is not available in IE7-IE8.":"","Bordered table":"","Add borders around the entire table and rounded corners for aesthetic purposes.":"","Condensed table":"","Make your tables more compact by adding the <code>.table-condensed</code> class to cut table cell padding in half (from 8px to 4px).":"","Combine them all!":"","Feel free to combine any of the table classes to achieve different looks by utilizing any of the available classes.":"","Full name":"","Flexible HTML and CSS":"","The best part about forms in Bootstrap is that all your inputs and controls look great no matter how you build them in your markup. No superfluous HTML is required, but we provide the patterns for those who require it.":"","More complicated layouts come with succinct and scalable classes for easy styling and event binding, so you're covered at every step.":"","Four layouts included":"","Bootstrap comes with support for four types of form layouts:":"","Vertical (default)":"","Inline":"","Horizontal":"","Different types of form layouts require some changes to markup, but the controls themselves remain and behave the same.":"","Control states and more":"","Bootstrap's forms include styles for all the base form controls like input, textarea, and select you'd expect. But it also comes with a number of custom components like appended and prepended inputs and support for lists of checkboxes.":"","States like error, warning, and success are included for each type of form control. Also included are styles for disabled controls.":"","Four types of forms":"","Bootstrap provides simple markup and styles for four styles of common web forms.":"","not required":"","Stacked, left-aligned labels over controls":"","Left-aligned label and inline-block controls for compact style":"","Extra-rounded text input for a typical search aesthetic":"","Float left, right-aligned labels on same line as controls":"","Example forms <small>using just form controls, no extra markup</small>":"","Basic form":"","With v2.0, we have lighter and smarter defaults for form styles. No extra markup, just form controls.":"","Label name":"","Type something…":"","Example block-level help text here.":"","Check me out":"","Submit":"","Search form":"","Reflecting default WebKit styles, just add <code>.form-search</code> for extra rounded search fields.":"","Inline form":"","Inputs are block level to start. For <code>.form-inline</code> and <code>.form-horizontal</code>, we use inline-block.":"","Email":"","Password":"","Remember me":"","Sign in":"","Horizontal forms":"","Controls Bootstrap supports":"","Text input":"","In addition to freeform text, any HTML5 text-based input appears like so.":"","Option one is this and that&mdash;be sure to include why it's great":"","Select list":"","Multicon-select":"","File input":"","Textarea":"","Cancel":"","Given the above example form layout, here's the markup associated with the first input and control group. The <code>.control-group</code>, <code>.control-label</code>, and <code>.controls</code> classes are all required for styling.":"","Legend text":"","Supporting help text":"","Shown on the left are all the default form controls we support. Here's the bulleted list:":"","text inputs (text, password, email, etc)":"","checkbox":"","radio":"","select":"","multiple select":"","file input":"","textarea":"","New defaults with v2.0":"","Up to v1.4, Bootstrap's default form styles used the horizontal layout. With Bootstrap 2, we removed that constraint to have smarter, more scalable defaults for any form.":"","Form control states":"","Focused input":"","This is focused…":"","Disabled input":"","Disabled input here…":"","Disabled checkbox":"","This is a disabled checkbox":"","Input with warning":"","Something may have gone wrong":"","Input with error":"","Please correct the error":"","Input with success":"","Woohoo!":"","Select with success":"","Redesigned browser states":"","Bootstrap features styles for browser-supported focused and <code>disabled</code> states. We remove the default Webkit <code>outline</code> and apply a <code>box-shadow</code> in its place for <code>:focus</code>.":"","It also includes validation styles for errors, warnings, and success. To use, add the error class to the surrounding <code>.control-group</code>.":"","Extending form controls":"","Form grid sizes":"","Use the same <code>.span*</code> classes from the grid system for input sizes.":"","Alternate sizes":"","You may also use static classes that don't map to the grid, adapt to the responsive CSS styles, or account for varying types of controls (e.g., <code>input</code> vs. <code>select</code>).":"","Prepended text":"","Here's some help text":"","Appended text":"","Here's more help text":"","Append and prepend":"","Append with button":"","Inline checkboxes":"","Option two can also be checked and included in form results":"","Option three can&mdash;yes, you guessed it&mdash;also be checked and included in form results":"","<strong>Note:</strong> Labels surround all the options for much larger click areas and a more usable form.":"","Radio buttons":"","Option two can is something else and selecting it will deselect option one":"","Prepend &amp; append inputs":"","Input groups&mdash;with appended or prepended text&mdash;provide an easy way to give more context for your inputs. Great examples include the @ sign for Twitter usernames or $ for finances.":"","Checkboxes and radios":"","Up to v1.4, Bootstrap required extra markup around checkboxes and radios to stack them. Now, it's a simple matter of repeating the <code>&lt;label class=\"checkbox\"&gt;</code> that wraps the <code>&lt;input type=\"checkbox\"&gt;</code>.":"","Inline checkboxes and radios are also supported. Just add <code>.inline</code> to any <code>.checkbox</code> or <code>.radio</code> and you're done.":"","Inline forms and append/prepend":"","To use prepend or append inputs in an inline form, be sure to place the <code>.add-on</code> and <code>input</code> on the same line, without spaces.":"","Form help text":"","To add help text for your form inputs, include inline help text with <code>&lt;span class=\"help-inline\"&gt;</code> or a help text block with <code>&lt;p class=\"help-block\"&gt;</code> after the input element.":"","Standard gray button with gradient":"","Primary":"","Provides extra visual weight and identifies the primary action in a set of buttons":"","Used as an alternate to the default styles":"","Indicates a successful or positive action":"","When using beside strings of text, as in buttons or nav links, be sure to leave a space after the <code>&lt;i&gt;</code> tag for proper spacing.":"","Dropdown menus can also be toggled from the bottom up by adding a single class to the immediate parent of <code>.dropdown-menu</code>. It will flip the direction of the <code>.caret</code> and reposition the menu itself to move from the bottom up instead of top down.":"","All nav components here&mdash;tabs, pills, and lists&mdash;<strong>share the same base markup and styles</strong> through the <code>.nav</code> class.":"","Tabs and pills are great for sections of content or navigating between pages of related content.":"","To align nav links, use the <code>.pull-left</code> or <code>.pull-right</code> utility classes. Both classes will add a CSS float in the specified direction.":"","As tabs and pills are horizontal by default, just add a second class, <code>.nav-stacked</code>, to make them appear vertically stacked.":"","Bring your tabs to life with a simple plugin to toggle between content via tabs. Bootstrap integrates tabbable tabs in four styles: top (default), right, bottom, and left.":"","Changing between them is easy and only requires changing very little markup.":"","To make tabs tabbable, wrap the <code>.nav-tabs</code> in another div with class <code>.tabbable</code>.":"","All tabbable tabs are powered by our lightweight jQuery plugin. Read more about how to bring tabbable tabs to life on the javascript docs page.":"","Fix the navbar to the top or bottom of the viewport with an additional class on the outermost div, <code>.navbar</code>.":"","When you affix the navbar, remember to account for the hidden area underneath. Add 40px or more of apdding to the <code>&lt;body&gt;</code>. Be sure to add this after the core Bootstrap CSS and before the optional responsive CSS.":"","Adding dropdowns and dropups to the nav is super simple, but does require the use of <a href=\"./javascript.html/#dropdown\">our javascript plugin</a>.":"","Breadcrumb navigation is used as a way to show users where they are within an app or a site, but not for primary navigation. Keep their use sparse and succinct to be most effective.":"","A single example shown as it might be displayed across multiple pages.":"","Ultra simplistic and minimally styled pagination inspired by Rdio, great for apps and search results. The large block is hard to miss, easily scalable, and provides large click areas.":"","Links are customizable and work in a number of circumstances with the right class. <code>.disabled</code> for unclickable links and <code>.active</code> for current page.":"","Add either of two optional classes to change the alignment of pagination links: <code>.pagination-centered</code> and <code>.pagination-right</code>.":"","The default pagination component is flexible and works in a number of variations.":"","Wrapped in a <code>&lt;div&gt;</code>, pagination is just a <code>&lt;ul&gt;</code>.":"","The pager component is a set of links for simple pagination implementations with light markup and even lighter styles. It's great for simple sites like blogs or magazines.":"","Pager links also use the general <code>.disabled</code> class from the pagination.":"","This is a simple hero unit, a simple jumbotron-style component for calling extra attention to featured content or information.":"","A simple shell for an <code>h1</code> to appropratiely space out and segment sections of content on a page. It can utilize the <code>h1</code>'s default <code>small</code>, element as well most other components (with additional styles).":""," You may optionally target a specific dropdown by using <code>data-target=\"#fat\"</code> or <code>href=\"#fat\"</code>.":"","title":"","interval":"","pause":"","Mixin":"","Upgrading to Bootstrap 2":"","<a href=\"./javascript.html#typeahead\">Typeahead</a>":""}}