{"Pages":{"10":"","On top of the scaffolding, basic HTML elements are styled and enhanced with extensible classes to provide a fresh, consistent look and feel.":"","Extending form controls":"","Form grid sizes":"","Use the same <code>.span*</code> classes from the grid system for input sizes.":"","Alternate sizes":"","You may also use static classes that don't map to the grid, adapt to the responsive CSS styles, or account for varying types of controls (e.g., <code>input</code> vs. <code>select</code>).":"","Prepended text":"","Here's some help text":"","Appended text":"","Here's more help text":"","Append and prepend":"","Append with button":"","Inline checkboxes":"","Option two can also be checked and included in form results":"","Option three can&mdash;yes, you guessed it&mdash;also be checked and included in form results":"","<strong>Note:</strong> Labels surround all the options for much larger click areas and a more usable form.":"","Radio buttons":"","Option two can is something else and selecting it will deselect option one":"","Prepend &amp; append inputs":"","Input groups&mdash;with appended or prepended text&mdash;provide an easy way to give more context for your inputs. Great examples include the @ sign for Twitter usernames or $ for finances.":"","Checkboxes and radios":"","Up to v1.4, Bootstrap required extra markup around checkboxes and radios to stack them. Now, it's a simple matter of repeating the <code>&lt;label class=\"checkbox\"&gt;</code> that wraps the <code>&lt;input type=\"checkbox\"&gt;</code>.":"","Inline checkboxes and radios are also supported. Just add <code>.inline</code> to any <code>.checkbox</code> or <code>.radio</code> and you're done.":"","Inline forms and append/prepend":"","To use prepend or append inputs in an inline form, be sure to place the <code>.add-on</code> and <code>input</code> on the same line, without spaces.":"","Form help text":"","To add help text for your form inputs, include inline help text with <code>&lt;span class=\"help-inline\"&gt;</code> or a help text block with <code>&lt;p class=\"help-block\"&gt;</code> after the input element.":"","Standard gray button with gradient":"","Primary":"","Provides extra visual weight and identifies the primary action in a set of buttons":"","Used as an alternate to the default styles":"","Indicates a successful or positive action":"","When using beside strings of text, as in buttons or nav links, be sure to leave a space after the <code>&lt;i&gt;</code> tag for proper spacing.":"","Dropdown menus can also be toggled from the bottom up by adding a single class to the immediate parent of <code>.dropdown-menu</code>. It will flip the direction of the <code>.caret</code> and reposition the menu itself to move from the bottom up instead of top down.":"","All nav components here&mdash;tabs, pills, and lists&mdash;<strong>share the same base markup and styles</strong> through the <code>.nav</code> class.":"","Tabs and pills are great for sections of content or navigating between pages of related content.":"","To align nav links, use the <code>.pull-left</code> or <code>.pull-right</code> utility classes. Both classes will add a CSS float in the specified direction.":"","As tabs and pills are horizontal by default, just add a second class, <code>.nav-stacked</code>, to make them appear vertically stacked.":"","Bring your tabs to life with a simple plugin to toggle between content via tabs. Bootstrap integrates tabbable tabs in four styles: top (default), right, bottom, and left.":"","Changing between them is easy and only requires changing very little markup.":"","To make tabs tabbable, wrap the <code>.nav-tabs</code> in another div with class <code>.tabbable</code>.":"","All tabbable tabs are powered by our lightweight jQuery plugin. Read more about how to bring tabbable tabs to life on the javascript docs page.":"","Fix the navbar to the top or bottom of the viewport with an additional class on the outermost div, <code>.navbar</code>.":"","When you affix the navbar, remember to account for the hidden area underneath. Add 40px or more of apdding to the <code>&lt;body&gt;</code>. Be sure to add this after the core Bootstrap CSS and before the optional responsive CSS.":"","Adding dropdowns and dropups to the nav is super simple, but does require the use of <a href=\"./javascript.html/#dropdown\">our javascript plugin</a>.":"","Breadcrumb navigation is used as a way to show users where they are within an app or a site, but not for primary navigation. Keep their use sparse and succinct to be most effective.":"","A single example shown as it might be displayed across multiple pages.":"","Ultra simplistic and minimally styled pagination inspired by Rdio, great for apps and search results. The large block is hard to miss, easily scalable, and provides large click areas.":"","Links are customizable and work in a number of circumstances with the right class. <code>.disabled</code> for unclickable links and <code>.active</code> for current page.":"","Add either of two optional classes to change the alignment of pagination links: <code>.pagination-centered</code> and <code>.pagination-right</code>.":"","The default pagination component is flexible and works in a number of variations.":"","Wrapped in a <code>&lt;div&gt;</code>, pagination is just a <code>&lt;ul&gt;</code>.":"","The pager component is a set of links for simple pagination implementations with light markup and even lighter styles. It's great for simple sites like blogs or magazines.":"","Pager links also use the general <code>.disabled</code> class from the pagination.":"","This is a simple hero unit, a simple jumbotron-style component for calling extra attention to featured content or information.":"","A simple shell for an <code>h1</code> to appropratiely space out and segment sections of content on a page. It can utilize the <code>h1</code>'s default <code>small</code>, element as well most other components (with additional styles).":""," You may optionally target a specific dropdown by using <code>data-target=\"#fat\"</code> or <code>href=\"#fat\"</code>.":"","title":"","interval":"","pause":"","Mixin":"","Upgrading to Bootstrap 2":"","<a href=\"./javascript.html#typeahead\">Typeahead</a>":""}}