{"Pages":{"Lead body copy":"","Make a paragraph stand out by adding <code>.lead</code>.":"","Horizontal description lists will truncate terms that are too long to fit in the left column fix <code>text-overflow</code>. In narrower viewports, they will change to the default stacked layout.":"","Smart and lightweight defaults without extra markup.":"","Add <code>.form-search</code> to the form and <code>.search-query</code> to the <code>input</code>.":"","Add <code>.form-inline</code> to finesse the vertical alignment and spacing of form controls.":"","":"","Shown on the right are all the default form controls we support. Here's the bulleted list:":"","Two-button append":"","Option two can be something else and selecting it will deselect option one":"","Used as an alternative to the default styles":"","There are 140 classes to choose from for your icons. Just add an <code>&lt;i&gt;</code> tag with the right classes and you're set. You can find the full list in <strong>sprites.less</strong> or right here in this document.":"","Utilize the extra button classes <code>.btn-mini</code>, <code>.btn-small</code>, or <code>.btn-large</code> for sizing.":"","Fade in tabs":"","To make tabs fade in, add <code>.fade</code> to each <code>.tab-pane</code>.":"","Requires jQuery plugin":"","All tabbable tabs are powered by our lightweight jQuery plugin. Read more about how to bring tabbable tabs to life <a href=\"./javascript.html#tabs\">on the javascript docs page</a>.":"","To make tabs tabbable, create a <code>.tab-pane</code> with unique ID for every tab and wrap them in <code>.tab-content</code>.":"","For right or left aligned tabs, wrap the <code>.nav-tabs</code> and <code>.tab-content</code> in <code>.tabbable</code>.":"","When you affix the navbar, remember to account for the hidden area underneath. Add 40px or more of padding to the <code>&lt;body&gt;</code>. Be sure to add this after the core Bootstrap CSS and before the optional responsive CSS.":"","For a more customized search form, add <code>.navbar-search</code> to the <code>form</code> and <code>.search-query</code> to the input for specialized styles in the navbar.":"","Adding dropdowns and dropups to the nav is super simple, but does require the use of <a href=\"./javascript.html#dropdowns\">our javascript plugin</a>.":"","Wrap strings of text in a <code>&lt;.navbar-text&gt;</code>, usually on a <code>&lt;p&gt;</code> tag for proper leading and color.":"","A simple shell for an <code>h1</code> to appropriately space out and segment sections of content on a page. It can utilize the <code>h1</code>'s default <code>small</code>, element as well most other components (with additional styles).":"","iOS devices require an <code>href=\"#\"</code> for the dismissal of alerts. Be sure to include it and the data attribute for anchor close icons. Alternatively, you may use a <code>&lt;button&gt;</code> element with the data attribute, which we have opted to do for our docs. When using <code>&lt;button&gt;</code>, you must include <code>type=\"button\"</code> or your forms may not submit.":"","iOS devices require an href=\"#\" for click events if you rather use an anchor.":"","Labels and badges":"","Visible/hidden classes":"","Narrow tablets and below (<767px)":"","Tablets to desktops (767-979px)":"","Large desktops (>1200px)":"","Responsive navbar":"","Download Bootstrap <small>(v2.0.4)</small>":"","Read the blog":"","To keep URLs intact, use the <code>data-target</code> attribute instead of <code>href=\"#\"</code>.":"","When using scrollspy in conjunction with adding or removing of elements from the DOM, you'll need to call the refresh method like so:":"","activate":"","This event fires whenever a new item becomes activated by the scrollspy.":"","Enable tabbable tabs via javascript (each tab needs to be activated individually):":"","You can activate individual tabs in several ways:":"","You can activate a tab or pill navigation without writing any javascript by simply specifying <code>data-toggle=\"tab\"</code> or <code>data-toggle=\"pill\"</code> on an element. Adding the <code>nav</code> and <code>nav-tabs</code> classes to the tab <code>ul</code> will apply the bootstrap tab styling.":"","Activates a tab element and content container. Tab should have either a <code>data-target</code> or an <code>href</code> targeting a container node in the DOM.":"","Tight pants next level keffiyeh <a href=\"#\" rel=\"tooltip\" title=\"first tooltip\">you probably</a> haven't heard of them. Photo booth beard raw denim letterpress vegan messenger bag stumptown. Farm-to-table seitan, mcsweeney's fixie sustainable quinoa 8-bit american apparel <a href=\"#\" rel=\"tooltip\" title=\"Another tooltip\">have a</a> terry richardson vinyl chambray. Beard stumptown, cardigans banh mi lomo thundercats. Tofu biodiesel williamsburg marfa, four loko mcsweeney's cleanse vegan chambray. A really ironic artisan <a href=\"#\" rel=\"tooltip\" title=\"Another one here too\">whatever keytar</a>, scenester farm-to-table banksy Austin <a href=\"#\" rel=\"tooltip\" title=\"The last tip!\">twitter handle</a> freegan cred raw denim single-origin coffee viral.":"","delay showing and hiding the tooltip (ms) - does not apply to manual trigger type":"","delay showing and hiding the popover (ms) - does not apply to manual trigger type":"","Requires the Transitions plugin to be included.":"","The amount of time to delay between automatically cycling an item. If false, carousel will not automatically cycle.":"","Scaffolding and links":"","Page background color":"","Default text color for entire body, headings, and more":"","Generate a percent grid system with <em>n</em> columns and <em>x</em> % wide gutter":"","Generate the pixel grid system for <code>input</code> elements, accounting for padding and borders":"","Turn any <code>div</code> into a grid column without the <code>.span*</code> classes":"","Prevent flickering of content when using CSS 3D transforms":"","CSS3 hyphenation when you want it (includes <code>word-wrap: break-word</code>)":"","Install the LESS command line compiler, JSHint, Recess, and uglify-js globally with npm by running the following command:":"","The default grid system provided in Bootstrap utilizes <strong>12 columns</strong> that render out at widths of 724px, 940px (default without responsive CSS included), and 1170px. Below 767px viewports, the columns become fluid and stack vertically. ":"","As shown here, a basic layout can be created with two \"columns\", each spanning a number of the 12 foundational columns we defined as part of our grid system.":"","Level 1 column":"","For faster mobile-friendly development, use these basic utility classes for showing and hiding content by device.":"","Resize your browser or load on different devices to test the above classes.":"","Green checkmarks indicate that class is visible in your current viewport.":"","Phone":"","Tablet":"","Desktop":"","Here, green checkmarks indicate that class is hidden in your current viewport.":""}}