{
  "Layout" : {
    "Overview" : "Geral",
    "Scaffolding" : "Fundação",
    "Base CSS" : "CSS Base",
    "Components" : "Componentes",
    "Javascript plugins" : "Plugins de Javascript",
    "Using LESS" : "Usando o LESS",
    "Customize" : "Customizando",
    "Examples" : "Exemplos",
    "Back to top" : "Voltar ao topo",
    "Designed and built with all the love in the world <a href=\"http://twitter.com/twitter\" target=\"_blank\">@twitter</a> by <a href=\"http://twitter.com/mdo\" target=\"_blank\">@mdo</a> and <a href=\"http://twitter.com/fat\" target=\"_blank\">@fat</a>." : "Desenvolvido com todo amor no mundo <a href=\"http://twitter.com/twitter\" target=\"_blank\">@twitter</a> por <a href=\"http://twitter.com/mdo\" target=\"_blank\">@mdo</a> e <a href=\"http://twitter.com/fat\" target=\"_blank\">@fat</a>.",
    "Code licensed under the <a href=\"http://www.apache.org/licenses/LICENSE-2.0\" target=\"_blank\">Apache License v2.0</a>. Documentation licensed under <a href=\"http://creativecommons.org/licenses/by/3.0/\">CC BY 3.0</a>." : "Código licenciado sob <a href=\"http://www.apache.org/licenses/LICENSE-2.0\" target=\"_blank\">Licença Apache v2.0</a>. A documentação é licenciada sob <a href=\"http://creativecommons.org/licenses/by/3.0/\">CC 3.0</a>.",
    "Icons from <a href=\"http://glyphicons.com\">Glyphicons Free</a>, licensed under <a href=\"http://creativecommons.org/licenses/by/3.0/\">CC BY 3.0</a>." : "Ícones do <a href=\"http://glyphicons.com\">Glyphicons Free</a>, licenciado sob <a href=\"http://creativecommons.org/licenses/by/3.0/\">CC 3.0</a>."
  },
  "Overview" : {
    "Overview" : "Visão geral"
  },
  "Base" : {
    "Base CSS" : "CSS Base",
    "On top of the scaffolding, basic HTML elements are styled and enhanced with extensible classes to provide a fresh, consistent look and feel.": "No topo da fundação, elementos HTML básicos são estilizados e melhorados com classes extensivas para prover uma consistência visual",
    "Typography" : "Tipografia",
    "Code" : "Código",
    "Tables" : "Tabelas",
    "Forms" : "Formulários",
    "Buttons" : "Botões",
    "Icons by Glyphicons" : "Ícones pelo Glyphicons",
    "Typography <small>Headings, paragraphs, lists, and other inline type elements</small>" : "Typografia <small>Cabeçalhos, parágrafos, listas, e outros elementos inline</small>",
    "Headings &amp; body copy" : "Cabeçalhos &amp; cópia do corpo",
    "Typographic scale" : "Escala tipográfica",
    "The entire typographic grid is based on two Less variables in our variables.less file: <code>@baseFontSize</code> and <code>@baseLineHeight</code>. The first is the base font-size used throughout and the second is the base line-height.": "Todo o grid de tipografia é baseado em duas variáveis Less no nosso arquivo variables.less: <code>@baseFontSize</code> e <code>@baseLineHeight</code>. O primeiro é o tamanho de fonte base usado em todo projeto e o segundo é a propriedade line-height base",
    "We use those variables, and some math, to create the margins, paddings, and line-heights of all our type and more.": "Nós usamos estas variáveis, e alguma matemática, para criar as margens, paddings, e line-heights de todos os tipos e mais",
    "Example body text" : "Exemplo de um corpo de texto",
    "Heading 1" : "Cabeçalho 1",
    "Heading 2" : "Cabeçalho 2",
    "Heading 3" : "Cabeçalho 3",
    "Heading 4" : "Cabeçalho 4",
    "Heading 5" : "Cabeçalho 5",
    "Heading 6" : "Cabeçalho 6",
    "Emphasis, address, and abbreviation" : "Ênfase, endereço e abreviação",
    "Element": "Elemento",
    "Usage": "Uso",
    "Optional": "Opcional",
    "For emphasizing a snippet of text with <strong>important</strong>": "Para enfatizar um pedaço de texto como <strong>importante</strong>",
    "None": "Nenhum",
    "For emphasizing a snippet of text with <em>stress</em>": "Para enfatizar um pedaço de texto com <em>stress</em>",
    "Wraps abbreviations and acronyms to show the expanded version on hover": "Usar abreviação e acrônimo para mostrar a versão expandida do hover",
    "Include optional <code>title</code> attribute for expanded text": "Incluir um atributo <code>title</code> opcional para texto expandido",
    "Use <code>.initialism</code> class for uppercase abbreviations.": "Use a classe <code>.initialism</code> para abreviações em caixa alta",
    "For contact information for its nearest ancestor or the entire body of work": "Para informações de contato para seu mais próximo ancestral ou o corpo inteiro de trabalho",
    "Preserve formatting by ending all lines with <code>&lt;br&gt;</code>": "Preservar formatação finalizando todas as linhas com <code>&lt;br&gt;</code>",
    "Using emphasis": "Usando ênfase",
    "<strong>Note:</strong> Feel free to use <code>&lt;b&gt;</code> and <code>&lt;i&gt;</code> in HTML5, but their usage has changed a bit. <code>&lt;b&gt;</code> is meant to highlight words or phrases without conveying additional importance while <code>&lt;i&gt;</code> is mostly for voice, technical terms, etc.":"<strong>Nota:</strong> Sinta-se a vontade para usar <code>&lt;b&gt;</code> e <code>&lt;i&gt;</code> no HTML5, mas seu uso muda um pouco. <code>&lt;b&gt;</code> é feito para chamar a atenção de palavras e frases sem importância adicional enquanto <code>&lt;i&gt;</code> é mais usado para voz, termos técnicos, etc.",
    "Example addresses": "Endereço de exemplo",
    "Here are two examples of how the <code>&lt;address&gt;</code> tag can be used:": "Aqui está mais dois exemplos de como a tag <code>&lt;address&gt;</code> pode ser usada",
    "Full Name": "Nome completo",
    "first.last@gmail.com": "primeiro.ultimo@gmail.com",
    "Example abbreviations": "Exemplos de abreviações",
    "Abbreviations with a <code>title</code> attribute have a light dotted bottom border and a help cursor on hover. This gives users extra indication something will be shown on hover.": "Abreviação com um atributo <code>título</code> tem uma leve borda tracejada e ajuda o cursor no estado sob o mouse. Isto dá uma indicação extra de que algo será mostrado no estado hover",
    "Add the <code>initialism</code> class to an abbreviation to increase typographic harmony by giving it a slightly smaller text size.": "Adicione a classe <code>initialism</code> para uma abreviação para aumentar a harmonia tipográfica dando um texto em um tamanho um pouco menor",
    "<abbr title=\"HyperText Markup Language\" class=\"initialism\">HTML</abbr> is the best thing since sliced bread.": "<abbr title=\"HyperText Markup Language\" class=\"initialism\">HTML</abbr> É a melhor coisa desde pão cortado.",
    "An abbreviation of the word attribute is <abbr title=\"attribute\">attr</abbr>.": "Uma abreviação da palavra atributo é <abbr title=\"attribute\">attr</abbr>.",
    "Blockquotes": "Bloco de citações",
    "Block-level element for quoting content from another source": "Elementos tipo bloco para conteúdos de citações de outras fontes",
    "Add <code>cite</code> attribute for source URL": "Adicionar o atributo <code>cite</code> para a url fonte",
    "Use <code>.pull-left</code> and <code>.pull-right</code> classes for floated options": "Use as classes <code>.pull-left</code> e <code>.pull-right</code> para as opções de float",
    "Optional element for adding a user-facing citation, typically an author with title of work": "Elementos opcionais para adicionar uma citação mais bonita, tipicamente de um autor com o título do trabalho",
    "Place the <code>&lt;cite&gt;</code> around the title or name of source": "coloque o <code>&lt;cite&gt;</code> em volta para mais de um título ou fonte",
    "To include a blockquote, wrap <code>&lt;blockquote&gt;</code> around any <abbr title=\"HyperText Markup Language\">HTML</abbr> as the quote. For straight quotes we recommend a <code>&lt;p&gt;</code>.": "Para incluir uma citação, coloque em volta a tag <code>&lt;blockquote&gt;</code> em torndo de qualquer <abbr title=\"HyperText Markup Language\">HTML</abbr> como citação. Para citações diretas, nós recomendamos usar um <code>&lt;p&gt;</code>.",
    "Include an optional <code>&lt;small&gt;</code> element to cite your source and you'll get an em dash <code>&amp;mdash;</code> before it for styling purposes.": "Incluído um elemento opcional <code>&lt;small&gt;</code> para citar a fonte e você terá uma barra <code>&amp;mdash;</code> antes para estilização",
    "Someone famous": "Alguém famoso",
    "Example blockquotes": "Exemplo de citações",
    "Default blockquotes are styled as such:": "Citações padrão já são estilizadas como tal",
    "Someone famous in <cite title=\"\">Body of work</cite>": "Alguém famoso no <cite title=\"\">Corpo de trabalho</cite>",
    "To float your blockquote to the right, add <code>class=\"pull-right\"</code>:": "Para flutuar a citação ara a direita, adicione a classe <code>class=\"pull-right\"</code>:",
    "Someone famous in <cite title=\"\">Body of work</cite>": "Alguém famoso no <cite title=\"\">Corpo de trabalho</cite>",
    "Lists": "Listas",
    "Unordered": "Não ordenado",
    "Unstyled": "Não estilizado",
    "Ordered": "Ordenado",
    "Description": "Descrição",
    "Description lists": "Listas de descrições",
    "A description list is perfect for defining terms.": "Uma lista de descrição é perfeita para definir termos",
    "Horizontal description": "Descrição horizontal",
    "Inline and block code snippets": "blocos de código inline e em bloco",
    "For example, &lt;code&gt;section&lt;/code&gt; should be wrapped as inline.": "Por exemplo, a tag &lt;code&gt;section&lt;/code&gt; deve ser considerada como inline.",
    "Use <code>&lt;pre&gt;</code> for multiple lines of code. Be sure to escape any angle brackets in the code for proper rendering.": "Use <code>&lt;pre&gt;</code> para múltiplas linhas de código. Tenha certeza de que você escapou qualquer entidade HTML para renderizar corretamente",
    "Sample text here...": "Algum texto aqui...",
    "<strong>Note:</strong> Be sure to keep code within <code>&lt;pre&gt;</code> tags as close to the left as possible; it will render all tabs.": "<strong>Nota:</strong> Tenha certeza de manter o código entre as tags <code>&lt;pre&gt;</code> a extrema esquerda, pois a tag conserva os tabs.",
    "You may optionally add the <code>.pre-scrollable</code> class which will set a max-height of 350px and provide a y-axis scrollbar.": "Você pode adicionar uma classe <code>.pre-scrollable</code> que irá setar o max-height de 350px para prover um scrollbar no eixo Y.",
    "<a href=\"http://code.google.com/p/google-code-prettify/\">Download google-code-prettify</a> and view the readme for <a href=\"http://google-code-prettify.googlecode.com/svn/trunk/README.html\">how to use</a>.": "<a href=\"http://code.google.com/p/google-code-prettify/\">Faça o Download do google-code-prettify</a> e leia o readme para <a href=\"http://google-code-prettify.googlecode.com/svn/trunk/README.html\">saber como usar</a>.",
    "Tables <small>For, you guessed it, tabular data</small>": "Tabelas <small>Para, como você adivinhou, dados tabulares</small>",
    "Table markup": "Marcação de tabelas",
    "Tag": "Tag",
    "Description": "Descrição",
    "Wrapping element for displaying data in a tabular format": "Envolvendo elementos para exibição de dados em um formato tabular de dados",
    "Container element for table header rows (<code>&lt;tr&gt;</code>) to label table columns": "Elemento principal para linhas da tabela (<code>&lt;tr&gt;</code>) e para rotular colunas",
    "Container element for table rows (<code>&lt;tr&gt;</code>) in the body of the table": "Elemento principal para linhas das tabelas (<code>&lt;tr&gt;</code>) no corpo da tabela",
    "Container element for a set of table cells (<code>&lt;td&gt;</code> or <code>&lt;th&gt;</code>) that appears on a single row": "Elemento principal para uma coleção de células (<code>&lt;td&gt;</code> ou <code>&lt;th&gt;</code>) que aparecem em uma única linha" ,
    "Default table cell": "Célula de tabela padrão",
    "Special table cell for column (or row, depending on scope and placement) labels": "Célula de tabela para rótulo de colunas(ou linha, dependendo do escopo e posição)",
    "Must be used within a <code>&lt;thead&gt;</code>": "Deve ser usado dentro de um <code>&lt;thead&gt;</code>",
    "Description or summary of what the table holds, especially useful for screen readers": "Descrição ou sumário do conteúdo do que a tabela carrega, útil para leitores de tela",
    "Table options": "Opções da tabela",
    "Name": "Nome",
    "Class": "Classe",
    "Default": "Padrão",
    "No styles, just columns and rows": "Sem estilos, só colunas e linhas",
    "Basic": "Básico",
    "Only horizontal lines between rows": "Somente linhas horizontais entre as linhas da tabela",
    "Bordered": "Com borda",
    "Rounds corners and adds outer border": "Bordas arredondadas e adiciona uma borda fora",
    "Zebra-stripe": "Tabela zebrada",
    "Adds light gray background color to odd rows (1, 3, 5, etc)": "Adiciona um fundo cinza claro para as linhas ímpares (1, 3, 5, etc)",
    "Condensed": "Condensada",
    "Cuts vertical padding in half, from 8px to 4px, within all <code>td</code> and <code>th</code> elements": "Corta a padding vertical ao meio, de 8 para 4px, dentro de todos os elementos <code>td</code> e <code>th</code>",
    "Example tables": "Tabelas de exemplo",
    "Default table styles": "Estilos de tabela padrão",
    "Tables are automatically styled with only a few borders to ensure readability and maintain structure. With 2.0, the <code>.table</code> class is required.": "Tabelas são automaticamente estilizadas com poucas bordas para garantir a leitura e manter uma estrutura. Com o 2.0, a classe <code>.table</code> é obrigatória",
    "First Name": "Primeiro nome",
    "Last Name": "Último nome",
    "Username": "Nome do usuário",
    "Striped table": "Tabela zebrada",
    "Get a little fancy with your tables by adding zebra-striping&mdash;just add the <code>.table-striped</code> class.": "Deixe suas tabelas mais estilosas adicionando uma classe zebra-striping somente adicionando a classe <code>.table-striped</code>",
    "<strong>Note:</strong> Striped tables use the <code>:nth-child</code> CSS selector and is not available in IE7-IE8.": "<strong>Nota</strong> As tabelas são zebradas usando o seletor <code>:nth-child</code> e não está disponível nas versões de IE7-IE8.",
    "Add borders around the entire table and rounded corners for aesthetic purposes.": "Adicionando bordas em bolta de toda a tabela e bordas arredondas para propósitos estéticos",
    "Condensed table": "Tabela condensada",
    "Make your tables more compact by adding the <code>.table-condensed</code> class to cut table cell padding in half (from 8px to 4px).": "Faça suas tabelas mais compactas adicionando a classe <code>.table-condensed</code> para cortar o padding pela metade (de 8px para 4px)",
    "Combine them all!": "Combine tudo",
    "Feel free to combine any of the table classes to achieve different looks by utilizing any of the available classes.": "Sinta-se livre para combinar qualquer classe da tabela para adquirir aparências diferentes utilizando qualquer uma das classes disponíveis",
    "Flexible HTML and CSS": "HTML e CSS flexíveis",
    "The best part about forms in Bootstrap is that all your inputs and controls look great no matter how you build them in your markup. No superfluous HTML is required, but we provide the patterns for those who require it.": "A melhor parte bout forms no Bootstrap é que todos os inputs e controles possuem uma ótima aparência não importa como você construa o markup. Nenhum HTML supérfulo é requerido, mas nós podemos provê os padrões onde é necessário",
    "More complicated layouts come with succinct and scalable classes for easy styling and event binding, so you're covered at every step.": "Layouts mais complicados vem com classes escaláveis e sucintas para fácil estilização e manipulação de eventos, então é coberta em cada passo",
    "Four layouts included": "Quatro layouts inclusos",
    "Bootstrap comes with support for four types of form layouts:": "O Bootstrap vem com suporte a 4 tipos de layouts para os formulários",
    "Vertical (default)": "Vertical (padrão)",
    "Search": "Busca",
    "Inline": "Inline",
    "Horizontal": "Horizontal",
    "Bordered table": "Tabelas com borda",
    "Full name": "Nome Completo",
    "Different types of form layouts require some changes to markup, but the controls themselves remain and behave the same.": "Diferentes tipos de layout para formulários requer alguma mudança de marcação, mas os controles se comportam da mesma maneira",
    "Control states and more": "Controles de estados e mais",
    "Bootstrap's forms include styles for all the base form controls like input, textarea, and select you'd expect. But it also comes with a number of custom components like appended and prepended inputs and support for lists of checkboxes.": "Os estilos de formulários do Bootstrap para todas as bases de controles de formulário como input, textarea, e select como você espera. Mas ele também vem com um número de componentes customizados como inputs do tipo appended e prepended e suporte para lista de checkboxes",
    "States like error, warning, and success are included for each type of form control. Also included are styles for disabled controls.": "Estados como erro, aviso, e sucesso são incluídos para cada tipo de controle de formulário. Também está incluído estilos para controles desabilitados",
    "Four types of forms": "Quatro tipo de forms",
    "Bootstrap provides simple markup and styles for four styles of common web forms.": "O Bootstrap provê marcação simples e estilos para quatro estilos comuns de formulários web",
    "not required": "não requerido",
    "Stacked, left-aligned labels over controls": "Estagnado, alinhado a esquerda sob os controles",
    "Left-aligned label and inline-block controls for compact style": "Rótulo alinhado a esquerda e controles inline-block para estilo compacto",
    "Extra-rounded text input for a typical search aesthetic": "Texto com arredondamento extra para uma busca títpica estética",
    "Float left, right-aligned labels on same line as controls": "Flutuando a esquerda, alinhado a direita com rótulo na mesma linha dos controles",
    "Example forms <small>using just form controls, no extra markup</small>": "Forms de exemplo <small>usando simplesmente controles de formulários, sem marcação extra</small>",
    "Basic form": "Formulário básico",
    "With v2.0, we have lighter and smarter defaults for form styles. No extra markup, just form controls.": "Com o 2.0, nós temos um padrão inteligente e conciso para formulários padrões. Sem marcação extra, somente controle de formulários",
    "Label name": "Nome do rótulo",
    "Type something…": "Digite algo",
    "Example block-level help text here.": "Exemplo de texto de ajuda em bloco",
    "Check me out": "Oha eu aqui",
    "Submit": "Enviar",
    "Search form": "Formulário de busca",
    "Reflecting default WebKit styles, just add <code>.form-search</code> for extra rounded search fields.": "Refletindo padrões do estilo WebKit, adicione a classe <code>.form-search</code> para bordas arredondadas extras",
    "Inline form": "Form inline",
    "Inputs are block level to start. For <code>.form-inline</code> and <code>.form-horizontal</code>, we use inline-block.": "Inputs são elementos blocos para começar. Para <code>.form-inline</code> e <code>.form-horizontal</code>, nós usamos inline-block",
    "Email": "Email",
    "Password": "Senha",
    "Remember me": "Lembrar de mim",
    "Sign in": "Logar-se",
    "Horizontal forms": "Formulário horizontal",
    "Controls Bootstrap supports": "Controles de suporte do Bootstrap",
    "Text input": "Input de texto",
    "In addition to freeform text, any HTML5 text-based input appears like so.": "Em adição do texto de forma livre, qualquer HTML5 baseado em input de texto aparecerá desta forma",
    "Checkbox": "Checkbox",
    "Option one is this and that&mdash;be sure to include why it's great": "Opção um é esta e&mdash;tenha certeza de incluir por que é ótimo",
    "Select list": "Lista de seleção",
    "Multicon-select": "Selecão multi ícone",
    "File input": "Input de arquivo",
    "Textarea": "Textarea",
    "Save changes": "Salvar mudanças",
    "Cancel": "Cancelar",
    "Example markup": "Marcação de exemplo",
    "Given the above example form layout, here's the markup associated with the first input and control group. The <code>.control-group</code>, <code>.control-label</code>, and <code>.controls</code> classes are all required for styling.": "O exemplo acima do layout do formulário, aqui há um markup associado com o primeiro input e grupo de controle. As classes <code>.control-group</code>, <code>.control-label</code>, e <code>.controls</code> são todos os requisitos para estilização",
    "Legend text": "Texto de legenda",
    "What's included": "O que é incluído",
    "Shown on the left are all the default form controls we support. Here's the bulleted list:": "Mostrado na esquerda todas os controles padrões que nós suportamos. Aqui há uma lista de marcação:",
    "text inputs (text, password, email, etc)": "inputs de texto(texto, senha, email, etc)",
    "New defaults with v2.0": "Novos padrões com a v2.0",
    "Up to v1.4, Bootstrap's default form styles used the horizontal layout. With Bootstrap 2, we removed that constraint to have smarter, more scalable defaults for any form.":  "Acima da versão 1.4, o padrão de estilos do formulário do Bootstrap usando o layout horizontal. Com o Bootstrap 2, nós removemos classes adicionais para ter padrões mais inteligentes e flexíveis para qualquer form",
    "Focused input": "Input com foco",
    "This is focused…": "Este está com foco...",
    "Disabled input": "Input desabilitado",
    "Disabled input here…": "Input desabilitado aqui...",
    "Disabled checkbox": "Checkbox desabilitado",
    "This is a disabled checkbox": "Este é um checkbox desabilitado",
    "Input with warning": "Input com aviso",
    "Something may have gone wrong": "Algo pode dar errado",
    "Input with error": "Input com erro",
    "Please correct the error": "Por favor corrija os erros",
    "Input with success": "Input com sucesso",
    "Woohoo!": "Woohoo!",
    "Select with success": "Selecionad com sucesso",
    "Bootstrap features styles for browser-supported focused and <code>disabled</code> states. We remove the default Webkit <code>outline</code> and apply a <code>box-shadow</code> in its place for <code>:focus</code>.": "As funcionalidades dos estilos do Bootstrap para o estado focus e <code>disabled</code>. Removemos o padrão do Webkit <code>outline</code> e aplicamos um <code>box-shadow</code> no lugar de <code>:focus</code>.",
    "It also includes validation styles for errors, warnings, and success. To use, add the error class to the surrounding <code>.control-group</code>.": "Também é incluido estilos de validação para erros, avisos, e sucesso. Para usar, adicione a classe de erro em volta do <code>.control-group</code>.",
    "Extending form controls": "Estendendo controles de formulários",
    "Form grid sizes": "Tamanhos do grid de formulário",
    "Use the same <code>.span*</code> classes from the grid system for input sizes.": "Use a mesma classe <span>.span*</span> para o sistema de grid para dar tamanho aos inputs",
    "Alternate sizes": "Alternar tamanhos",
    "You may also use static classes that don't map to the grid, adapt to the responsive CSS styles, or account for varying types of controls (e.g., <code>input</code> vs. <code>select</code>).": "Você pode também usar classes estáticas que não são mapeadas para o grid, adaptado para estilos de css responsive, ou variando os tipos de controle (ex: <code>input</code> vs. <code>select</code>).",
    "Prepended text": "Texto anterior",
    "Here's some help text": "Aqui é algum texto de ajuda",
    "Appended text": "Texto inserido",
    "Here's more help text": "Aqui é algum texto de ajuda",
    "Append and prepend": "Texto antes de depois",
    "Append with button": "Inserido com botão",
    "Inline checkboxes": "Checkbox inline",
    "Supporting help text": "Suporte a textos de ajuda",
    "Option two can also be checked and included in form results": "Opção 2 pode também ser escolhida e inluída no resultado do formulário",
    "Option three can&mdash;yes, you guessed it&mdash;also be checked and included in form results": "Opção três pode &mdash;sim, como você adivinhou&mdash;pode também ser escolhida e incluída no resultado do formulário",
    "<strong>Note:</strong> Labels surround all the options for much larger click areas and a more usable form.": "<strong>Nota:</strong> Rótulos em volta das opções para área de cliques maiores e formulários mais bem usáveis.",
    "Radio buttons": "Botões do tipo radio",
    "Option two can is something else and selecting it will deselect option one": "Opção um pode ser algo mais e selecionando-o irá deselecionar a opção dois",
    "Prepend &amp; append inputs": "Prependar &amp; input apendados",
    "Input groups&mdash;with appended or prepended text&mdash;provide an easy way to give more context for your inputs. Great examples include the @ sign for Twitter usernames or $ for finances.": "grupos de input&mdash; com textos apendados ou prependados provê um fácil um caminho para dar mais contexto para seus inputs. Ótimo exemplo inclui o sinal @ para usuários twitter ou $ para dados relacionados com finanças.",
    "Checkboxes and radios": "Checkboxes e radios",
    "Up to v1.4, Bootstrap required extra markup around checkboxes and radios to stack them. Now, it's a simple matter of repeating the <code>&lt;label class=\"checkbox\"&gt;</code> that wraps the <code>&lt;input type=\"checkbox\"&gt;</code>.": "Acima da versão 1.4, o Bootstrap requer markup extra em volta dos checkboxes e raidos para estagná-los. Agora, é uma simples questão de repetir o <code>&lt;label class=\"checkbox\"&gt;</code> que fica em torno do <code>&lt;input type=\"checkbox\"&gt;</code>.",
    "Inline checkboxes and radios are also supported. Just add <code>.inline</code> to any <code>.checkbox</code> or <code>.radio</code> and you're done.": "Checkboxes inline e radios são também suportados. Só adicione <code>.inline</code> em qualquer <code>.checkbox</code> ou <code>.radio</code> e está pronto",
    "Inline forms and append/prepend": "Forms inline apendados/prependados",
    "To use prepend or append inputs in an inline form, be sure to place the <code>.add-on</code> and <code>input</code> on the same line, without spaces.": "Para usar inputs pré-inseridos ou pós-inseridos em um form inline, certifique-se de colocar <code>.add-on</code> e <code>input</code> na mesma linha, sem espaços",
    "Form help text": "Texto de ajuda do formulário",
    "To add help text for your form inputs, include inline help text with <code>&lt;span class=\"help-inline\"&gt;</code> or a help text block with <code>&lt;p class=\"help-block\"&gt;</code> after the input element.": "Para dicionar texto de ajuda nos seus inputs, inclua o texto de ajuda inline com <code>&lt;span class=\"help-inline\"&gt;</code> ou um texto de ajuda em bloco com <code>&lt;p class=\"help-block\"&gt;</code>",
    "Button": "Botão",
    "Standard gray button with gradient": "Botão cinza padrão com gradiente",
    "Primary": "Primária",
    "Provides extra visual weight and identifies the primary action in a set of buttons": "Provê um visual extra e indentifica a acão primária de uma coleção de botões",
    "Info": "Informações",
    "Used as an alternate to the default styles": "Usado como alternativa a estilos padrões",
    "Success": "Sucesso",
    "Indicates a successful or positive action": "Indicadores de uma ação de atitude positiva",
    "Warning": "Aviso",
    "checkbox": "checkbox",
    "radio": "radio",
    "select": "select",
    "multiple select": "select múltiplo",
    "file input": "input de arquivo",
    "textarea": "textarea",
    "Form control states": "controles de estados de formulário",
    "Redesigned browser states": "Estados do browser redesenhados"
        
  },
  "Components" : {
    "Components" : "Componentes"
  },
  "Download" : {
    "Download" : "Download"
  },
  "Examples" : {
    "Examples" : "Exemplos"
  },
  "Index" : {
    "Index" : "Página Inicial"
  },
  "Javascript" : {
    "Javascript" : "Javascript"
  },
  "Less" : {
    "Less" : "Less"
  },
  "Scaffolding" : {
    "Scaffolding" : "Fundação"
  },
  "Upgrading" : {
    "Upgrading" : "Atualizando",
    "Upgrading to Bootstrap 2" : "Atualizando para o Bootstrap 2"
  }
}
